app/controllers/places_controller.rb

  def index
    @places = Place.all
---
SELECT "places".* FROM "places"

  def create
    puts 'params'
    puts params
    Place.create(title: params["title"], url: params["url"], admission_price: params["admission_price"], description: params["description"])
---
INSERT INTO "places" ("admission_price", "description", "title", "url") VALUES (?, ?, ?, ?)  [["admission_price", 6000], ["description", "Where the Chicago Bulls play"], ["title", "United Center"], ["url", "http://unitedcenter.com"]]

  def edit
    puts 'we will wedit'
    @place = Place.find_by(:id => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 76 LIMIT 1

  def update
    puts 'we will update'
    @place = Place.find_by(:id => params["id"])
    @place.update(title: params["title"], url: params["url"], admission_price: params["admission_price"], description: params["description"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" IS NULL LIMIT 1
UPDATE "places" SET "admission_price" = ?, "description" = ?, "title" = ?, "url" = ? WHERE "places"."id" = 87  [["admission_price", 600023332], ["description", "Where the BFAKEKKulls play"], ["title", "United CenterFAKE"], ["url", "http://FAKEunitedcenter.com"]]

  def show
    @place = Place.find_by(:id => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 0 LIMIT 1

  def delete
    place = Place.find_by(id: params["id"])
     if !place.nil?
      place.delete
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 36 LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 36